osherbakov/STM32F4XX/DSM_D407/Drivers/BSP/STM32F4-Discovery/nRF24L01func.c
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "nRF24L01.h"
#include "nRF24L01conf.h"
#include "nRF24L01regs.h"
#include "nRF24L01func.h"

#define RF24_ce(a) NRF24L01_CE(a)

#define MAX_PAYLOAD_SIZE   (32)

#ifndef TRUE 
#define TRUE  (1)
#endif
#ifndef FALSE
#define FALSE (0)
#endif
#ifndef HIGH 
#define HIGH  (1)
#endif
#ifndef LOW
#define LOW (0)
#endif

extern uint32_t HAL_GetTick(void);
extern void		HAL_Delay(uint32_t delay_ms);
extern void 	delayMicroseconds(uint32_t delay_us);

#define millis    HAL_GetTick
#define delay	  HAL_Delay

/****************************************************************************/


  int p_variant; 			/* False for RF24L01 and true for RF24L01P */
  int dynamic_payloads_enabled; /**< Whether dynamic payloads are enabled. */
  int failureDetected; 

  uint8_t payload_size; 	/**< Fixed size of payloads */
  uint8_t pipe0_reading_address[5]; /**< Last address set on pipe 0 for reading. */
  uint8_t addr_width; 		/**< The address width to use - 3,4 or 5 bytes. */
  uint32_t txRxDelay; 		/**< Var for adjusting delays depending on datarate */

/****************************************************************************/
uint8_t RF24_read_register_block(uint8_t reg, uint8_t* buf, uint8_t len)
{
  return NRF24L01_Read(R_REGISTER | ( REGISTER_MASK & reg ), buf, len);
}

/****************************************************************************/

uint8_t RF24_read_register(uint8_t reg)
{
  return NRF24L01_ReadByte(R_REGISTER | ( REGISTER_MASK & reg ));
}

/****************************************************************************/

uint8_t RF24_write_register_block(uint8_t reg, uint8_t* buf, uint8_t len)
{
  return NRF24L01_Write(W_REGISTER | ( REGISTER_MASK & reg ), buf, len);
}

/****************************************************************************/

uint8_t RF24_write_register(uint8_t reg, uint8_t value)
{
  return NRF24L01_WriteByte(W_REGISTER | ( REGISTER_MASK & reg ), value);
}

/****************************************************************************/

uint8_t RF24_write_payload_type(const void* buf, uint8_t data_len, uint8_t writeType)
{
  return NRF24L01_Write(writeType, (uint8_t *)buf, data_len);
}

uint8_t RF24_write_payload(const void* buf, uint8_t data_len)
{
  return NRF24L01_Write(W_TX_PAYLOAD, (uint8_t *)buf, data_len);
}

/****************************************************************************/

uint8_t RF24_read_payload(void* buf, uint8_t data_len)
{
  return NRF24L01_Read(R_RX_PAYLOAD, buf, data_len);
}

/****************************************************************************/

uint8_t RF24_flushRx(void)
{
  return NRF24L01_TouchByte(FLUSH_RX);
}

/****************************************************************************/

uint8_t RF24_flushTx(void)
{
  return NRF24L01_TouchByte(FLUSH_TX);
}

/****************************************************************************/

uint8_t RF24_getStatus(void)
{
  return NRF24L01_TouchByte(NOP);
}

/****************************************************************************/
#if !defined (MINIMAL)
void RF24_print_status(uint8_t status)
{
  printf_P(PSTR("STATUS\t\t = 0x%02x RX_DR=%x TX_DS=%x MAX_RT=%x RX_P_NO=%x TX_FULL=%x\r\n"),
           status,
           (status & _BV(RX_DR))?1:0,
           (status & _BV(TX_DS))?1:0,
           (status & _BV(MAX_RT))?1:0,
           ((status >> RX_P_NO) & 0b111),
           (status & _BV(TX_FULL))?1:0
          );
}

/****************************************************************************/

void RF24_print_observe_tx(uint8_t value)
{
  printf_P(PSTR("OBSERVE_TX=%02x: POLS_CNT=%x ARC_CNT=%x\r\n"),
           value,
           (value >> PLOS_CNT) & 0b1111,
           (value >> ARC_CNT) & 0b1111
          );
}

/****************************************************************************/

void RF24_print_byte_register(const char* name, uint8_t reg, uint8_t qty)
{
  //char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
  //printf_P(PSTR(PRIPSTR"\t%c ="),name,extra_tab);
  printf_P(PSTR(PRIPSTR"\t ="),name);
  while (qty--)
    printf_P(PSTR(" 0x%02x"),RF24_read_register(reg++));
  printf_P(PSTR("\r\n"));
}

/****************************************************************************/

void RF24_print_address_register(const char* name, uint8_t reg, uint8_t qty)
{
  printf_P(PSTR(PRIPSTR"\t ="),name);
  while (qty--)
  {
    uint8_t buffer[5];
	uint8_t* bufptr;

    RF24_read_register_block(reg++, buffer, addr_width);
    printf_P(PSTR(" 0x"));
    bufptr = buffer + addr_width;
    while( --bufptr >= buffer )
      printf_P(PSTR("%02x"),*bufptr);
  }
  printf_P(PSTR("\r\n"));
}
#endif

/****************************************************************************/

void RF24_setChannel(uint8_t channel)
{
  RF24_write_register(RF_CH, rf24_min(channel,127));
}

uint8_t RF24_getChannel()
{
  return RF24_read_register(RF_CH);
}
/****************************************************************************/

void RF24_setPayloadSize(uint8_t size)
{
  payload_size = rf24_min(size,MAX_PAYLOAD_SIZE);
}

/****************************************************************************/

uint8_t RF24_getPayloadSize(void)
{
  return payload_size;
}

/****************************************************************************/

#if !defined (MINIMAL)

static const char rf24_datarate_e_str_0[] PROGMEM = "1MBPS";
static const char rf24_datarate_e_str_1[] PROGMEM = "2MBPS";
static const char rf24_datarate_e_str_2[] PROGMEM = "250KBPS";
static const char * const rf24_datarate_e_str_P[] PROGMEM = {
  rf24_datarate_e_str_0,
  rf24_datarate_e_str_1,
  rf24_datarate_e_str_2,
};
static const char rf24_model_e_str_0[] PROGMEM = "nRF24L01";
static const char rf24_model_e_str_1[] PROGMEM = "nRF24L01+";
static const char * const rf24_model_e_str_P[] PROGMEM = {
  rf24_model_e_str_0,
  rf24_model_e_str_1,
};
