osherbakov/STM32F4XX/DSM_D407/Drivers/BSP/STM32F4-Discovery/nRF24L01func.c
static const char rf24_crclength_e_str_0[] PROGMEM = "Disabled";
static const char rf24_crclength_e_str_1[] PROGMEM = "8 bits";
static const char rf24_crclength_e_str_2[] PROGMEM = "16 bits" ;
static const char * const rf24_crclength_e_str_P[] PROGMEM = {
  rf24_crclength_e_str_0,
  rf24_crclength_e_str_1,
  rf24_crclength_e_str_2,
};
static const char rf24_pa_dbm_e_str_0[] PROGMEM = "PA_MIN";
static const char rf24_pa_dbm_e_str_1[] PROGMEM = "PA_LOW";
static const char rf24_pa_dbm_e_str_2[] PROGMEM = "PA_HIGH";
static const char rf24_pa_dbm_e_str_3[] PROGMEM = "PA_MAX";
static const char * const rf24_pa_dbm_e_str_P[] PROGMEM = {
  rf24_pa_dbm_e_str_0,
  rf24_pa_dbm_e_str_1,
  rf24_pa_dbm_e_str_2,
  rf24_pa_dbm_e_str_3,
};

void RF24_printDetails(void)
{

  printf("\n================ NRF Configuration ================\n");
  RF24_print_status(RF24_getStatus());
  RF24_print_address_register(PSTR("RX_ADDR_P0-1"),RX_ADDR_P0,2);
  RF24_print_byte_register(PSTR("RX_ADDR_P2-5"),RX_ADDR_P2,4);
  RF24_print_address_register(PSTR("TX_ADDR\t"),TX_ADDR, 1);

  RF24_print_byte_register(PSTR("RX_PW_P0-6"),RX_PW_P0,6);
  RF24_print_byte_register(PSTR("EN_AA\t"),EN_AA, 1);
  RF24_print_byte_register(PSTR("EN_RXADDR"),EN_RXADDR, 1);
  RF24_print_byte_register(PSTR("RF_CH\t"),RF_CH, 1);
  RF24_print_byte_register(PSTR("RF_SETUP"),RF_SETUP, 1);
  RF24_print_byte_register(PSTR("CONFIG\t"),CONFIG, 1);
  RF24_print_byte_register(PSTR("DYNPD/FEATURE"),DYNPD, 2);

  printf_P(PSTR("Data Rate\t = %s\r\n"),pgm_read_word(&rf24_datarate_e_str_P[RF24_getDataRate()]));
  printf_P(PSTR("Model\t\t = %s\r\n"),pgm_read_word(&rf24_model_e_str_P[RF24_isPVariant()]));
  printf_P(PSTR("CRC Length\t = %s\r\n"),pgm_read_word(&rf24_crclength_e_str_P[RF24_getCRCLength()]));
  printf_P(PSTR("PA Power\t = %s\r\n"),  pgm_read_word(&rf24_pa_dbm_e_str_P[RF24_getPALevel()]));
}

#endif
/****************************************************************************/
/****************************************************************************/

void RF24_Init()
{
  p_variant = 0;
  payload_size = MAX_PAYLOAD_SIZE;
  dynamic_payloads_enabled = 0;
  addr_width = 5;
  pipe0_reading_address[0] = 0;
 
  // Must allow the radio time to settle else configuration bits will not necessarily stick.
  // This is actually only required following power up but some settling time also appears to
  // be required after resets too. For full coverage, we'll always assume the worst.
  // Enabling 16b CRC is by far the most obvious case if the wrong timing is used - or skipped.
  // Technically we require 4.5ms + 14us as a worst case. We'll just call it 5ms for good measure.
  // WARNING: Delay is based on P-variant whereby non-P *may* require different timing.

//  delay( 5 ) ;

  // Reset CONFIG and enable 16-bit CRC.
  RF24_write_register( CONFIG, 0b00001100 ) ;

  // Set 1500uS (minimum for 32B payload in ESB@250KBPS) timeouts, to make testing a little easier
  // WARNING: If this is ever lowered, either 250KBS mode with AA is broken or maximum packet
  // sizes must never be used. See documentation for a more complete explanation.
  RF24_setRetries(5,15);

  // Reset value is MAX
  RF24_setPALevel( RF24_PA_MAX ) ;

  // check for connected module and if this is a p nRF24l01 variant
  //
  if( RF24_setDataRate( RF24_250KBPS ) )
  {
    p_variant = TRUE ;
  }
  /*setup = read_register(RF_SETUP);
  if( setup == 0b00001110 )     // register default for nRF24L01P
  {
    p_variant = true ;
  }*/
  
  // Then set the data rate to the slowest (and most reliable) speed supported by all
  // hardware.
  RF24_setDataRate( RF24_1MBPS ) ;

  // Initialize CRC and request 2-byte (16bit) CRC
  RF24_setCRCLength( RF24_CRC_16 ) ;

  // Disable dynamic payloads, to match dynamic_payloads_enabled setting - Reset value is 0
  RF24_toggle_features();
  RF24_write_register(FEATURE,0 );
  RF24_write_register(DYNPD,0);

  // Reset current status
  // Notice reset and flush is the last thing we do
  RF24_write_register(NRF_STATUS,_BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

  // Set up default configuration.  Callers can always change it later.
  // This channel should be universally safe and not bleed over into adjacent
  // spectrum.
  RF24_setChannel(76);

  // Flush buffers
  RF24_flushRx();
  RF24_flushTx();

  RF24_powerUp(); //Power up by default when begin() is called

  // Enable PTX, do not write CE high so radio will remain in standby I mode ( 130us max to transition to RX or TX instead of 1500us from powerUp )
  // PTX should use only 22uA of power
  RF24_write_register(CONFIG, ( RF24_read_register(CONFIG) ) & ~_BV(PRIM_RX) );
}

/****************************************************************************/

void RF24_startListening(void)
{
  RF24_powerUp();
  RF24_write_register(CONFIG, RF24_read_register(CONFIG) | _BV(PRIM_RX));
  RF24_write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );
  RF24_ce(HIGH);
  // Restore the pipe0 adddress, if exists
  if (pipe0_reading_address[0] > 0){
    RF24_write_register_block(RX_ADDR_P0, pipe0_reading_address, addr_width);	
  }else{
	RF24_closeReadingPipe(0);
  }

  // Flush buffers
  //flush_rx();
  if(RF24_read_register(FEATURE) & _BV(EN_ACK_PAY)){
	RF24_flushTx();
  }

  // Go!
  //delayMicroseconds(100);
}

/****************************************************************************/
static const uint8_t child_pipe_enable[] PROGMEM =
{
  ERX_P0, ERX_P1, ERX_P2, ERX_P3, ERX_P4, ERX_P5
};

void RF24_stopListening(void)
{  
  RF24_ce(LOW);

  delayMicroseconds(txRxDelay);
  
  if(RF24_read_register(FEATURE) & _BV(EN_ACK_PAY)){
    delayMicroseconds(txRxDelay); //200
	RF24_flushTx();
  }
  //flush_rx();
  RF24_write_register(CONFIG, ( RF24_read_register(CONFIG) ) & ~_BV(PRIM_RX) );
  RF24_write_register(EN_RXADDR, RF24_read_register(EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[0]))); // Enable RX on pipe0
  
  //delayMicroseconds(100);

}

/****************************************************************************/

void RF24_powerDown(void)
{
  RF24_ce(LOW); // Guarantee CE is low on powerDown
  RF24_write_register(CONFIG, RF24_read_register(CONFIG) & ~_BV(PWR_UP));
}

