osherbakov/STM32F4XX/DSM_D407/Drivers/BSP/STM32F4-Discovery/nRF24L01func.c
}

/****************************************************************************/

//Added the original startWrite back in so users can still use interrupts, ack payloads, etc
//Allows the library to pass all tests
void RF24_startWriteAck(void* buf, uint8_t len, const int multicast ){

  // Send the payload

  //write_payload( buf, len );
  RF24_write_payload_type( buf, len,multicast? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD ) ;
  RF24_ce(HIGH);
  delayMicroseconds(10);
  RF24_ce(LOW);
}

/****************************************************************************/

int RF24_rxFifoFull(){
	return RF24_read_register(FIFO_STATUS) & _BV(RX_FULL);
}
/****************************************************************************/

int RF24_txStandBy(){

    #if defined (FAILURE_HANDLING) || defined (RF24_LINUX)
		uint32_t timeout = millis();
	#endif
	while( ! (RF24_read_register(FIFO_STATUS) & _BV(TX_EMPTY)) ){
		if( RF24_getStatus() & _BV(MAX_RT)){
			RF24_write_register(NRF_STATUS,_BV(MAX_RT) );
			RF24_ce(LOW);
			RF24_flushTx();    //Non blocking, flush the data
			return 0;
		}
		#if defined (FAILURE_HANDLING) || defined (RF24_LINUX)
			if( millis() - timeout > 85){
				RF24_errNotify();
				#if defined (FAILURE_HANDLING)
				return 0;	
				#endif
			}
		#endif
	}

	RF24_ce(LOW);			   //Set STANDBY-I mode
	return 1;
}

/****************************************************************************/

int RF24_txStandByAndWait(uint32_t timeout, int startTx){

    if(startTx){
	  RF24_stopListening();
	  RF24_ce(HIGH);
	}
	uint32_t start = millis();

	while( ! (RF24_read_register(FIFO_STATUS) & _BV(TX_EMPTY)) ){
		if( RF24_getStatus() & _BV(MAX_RT)){
				RF24_write_register(NRF_STATUS,_BV(MAX_RT) );
				RF24_ce(LOW);										  //Set re-transmit
				RF24_ce(HIGH);
				if(millis() - start >= timeout){
					RF24_ce(LOW); RF24_flushTx(); return 0;
				}
		}
		#if defined (FAILURE_HANDLING) || defined (RF24_LINUX)
			if( millis() - start > (timeout+85)){
				RF24_errNotify();
				#if defined (FAILURE_HANDLING)
				return 0;	
				#endif
			}
		#endif
	}
	
	RF24_ce(LOW);				   //Set STANDBY-I mode
	return 1;

}

/****************************************************************************/

void RF24_maskIRQ(int tx, int fail, int rx){

	RF24_write_register(CONFIG, ( RF24_read_register(CONFIG) ) | fail << MASK_MAX_RT | tx << MASK_TX_DS | rx << MASK_RX_DR  );
}

/****************************************************************************/

uint8_t RF24_getDynamicPayloadSize(void)
{
  uint8_t result;
  result = NRF24L01_ReadByte( R_RX_PL_WID );
  if(result > MAX_PAYLOAD_SIZE) { RF24_flushRx(); delay(2); return 0; }
  return result;
}

/****************************************************************************/

int RF24_availableAny(void)
{
  return RF24_rxAvailable(NULL);
}

/****************************************************************************/

int RF24_rxAvailable(uint8_t* pipe_num)
{
  if (!( RF24_read_register(FIFO_STATUS) & _BV(RX_EMPTY) )){
    // If the caller wants the pipe number, include that
    if ( pipe_num ){
	  uint8_t status = RF24_getStatus();
      *pipe_num = ( status >> RX_P_NO ) & 0b111;
  	}
  	return 1;
  }
  return 0;
}

/****************************************************************************/

void RF24_read( void* buf, uint8_t len ){

  // Fetch the payload
  RF24_read_payload( buf, len );
  //Clear the two possible interrupt flags with one command
  RF24_write_register(NRF_STATUS,_BV(RX_DR) | _BV(MAX_RT) | _BV(TX_DS) );

}

/****************************************************************************/

void RF24_whatHappened(int *tx_ok,int *tx_fail,int  *rx_ready)
{
  // Read the status & reset the status in one easy call
  // Or is that such a good idea?
  uint8_t status = RF24_write_register(NRF_STATUS,_BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

  // Report to the user what happened
  *tx_ok = status & _BV(TX_DS);
  *tx_fail = status & _BV(MAX_RT);
  *rx_ready = status & _BV(RX_DR);
}

/****************************************************************************/

/****************************************************************************/
void RF24_openWritingPipe(uint8_t *address)
{
  // Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
  // expects it LSB first too, so we're good.

  RF24_write_register_block(RX_ADDR_P0,address, addr_width);
  RF24_write_register_block(TX_ADDR, address, addr_width);

  //const uint8_t max_payload_size = 32;
  //write_register(RX_PW_P0,rf24_min(payload_size,max_payload_size));
  RF24_write_register(RX_PW_P0,payload_size);
}

/****************************************************************************/
static const uint8_t child_pipe[] PROGMEM =
{
  RX_ADDR_P0, RX_ADDR_P1, RX_ADDR_P2, RX_ADDR_P3, RX_ADDR_P4, RX_ADDR_P5
};
static const uint8_t child_payload_size[] PROGMEM =
{
  RX_PW_P0, RX_PW_P1, RX_PW_P2, RX_PW_P3, RX_PW_P4, RX_PW_P5
};

/****************************************************************************/
void RF24_setAddressWidth(uint8_t a_width){

	if(a_width -= 2){
		RF24_write_register(SETUP_AW,a_width%4);
		addr_width = (a_width%4) + 2;
	}
}

/****************************************************************************/

void RF24_openReadingPipe(uint8_t child, uint8_t *address)
{
  // If this is pipe 0, cache the address.  This is needed because
  // openWritingPipe() will overwrite the pipe 0 address, so
  // startListening() will have to restore it.
  if (child == 0){
    memcpy(pipe0_reading_address,address,addr_width);
  }
  if (child <= 6)
  {
    // For pipes 2-5, only write the LSB
    if ( child < 2 ){
      RF24_write_register_block(pgm_read_byte(&child_pipe[child]), address, addr_width);
    }else{
      RF24_write_register_block(pgm_read_byte(&child_pipe[child]), address, 1);
	}
    RF24_write_register(pgm_read_byte(&child_payload_size[child]),payload_size);

    // Note it would be more efficient to set all of the bits for all open
    // pipes at once.  However, I thought it would make the calling code
    // more simple to do it this way.
    RF24_write_register(EN_RXADDR, RF24_read_register(EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[child])));
  }
}

